//
//  QuranParaNames.swift
//  FireTester
//
//  Created by Danial Zahid on 04/08/2015.
//  Copyright (c) 2015 Danial Zahid. All rights reserved.
//

import UIKit

class QuranParaNames: NSObject {
   
    static let paraDictionary : [Int : String] = [1:"الم",
    2:"سَيَقُولُ",
    3:"تِلْكَ الرُّسُلُ",
    4:"لَنْ تَنَالُوا",
    5:"وَالْمُحْصَنَاتُ",
    6:"لَا يُحِبُّ اللَّهُ",
    7:"وَإِذَا سَمِعُوا",
    8:"وَلَوْ أَنَّنَا",
    9:"قَالَ الْمَلَأُ",
    10:"وَاعْلَمُوا",
    11:"يَعْتَذِرُونَ",
    12:"وَمَا مِنْ دَابَّةٍ",
    13:"وَمَا أُبَرِّئُ",
    14:"رُبَمَا",
    15:"سُبْحَانَ الَّذِي",
    16:"قَالَ أَلَمْ",
    17:"اقْتَرَبَ",
    18:"قَدْ أَفْلَحَ",
    19:"وَقَالَ الَّذِينَ",
    20:"أَمَّنْ خَلَقَ",
    21:"اتْلُ مَا أُوحِيَ",
    22:"وَمَنْ يَقْنُتْ",
    23:"وَمَا لِيَ",
    24:"فَمَنْ أَظْلَمُ",
    25:"إِلَيْهِ يُرَدُّ",
    26:"حم",
    27:"قَالَ فَمَا خَطْبُكُمْ",
    28:"قَدْ سَمِعَ اللَّ",
    29:"تَبَارَكَ الَّذِي",
    30:"عَمَّ يَتَسَاءَلُونَ"]

    func nameForParaNumber(paraNo: Int) -> String{
        return QuranParaNames.paraDictionary[paraNo]!
    }
    
}

